# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','AAPL','AAPL','AMZN','AMZN'],
       'Country':['US','CHN','JPN','UK','GER','MEX'],
       'Hits':[4000,1120,3340,657,7452,3500]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

  Company Country  Hits
0    GOOG      US  4000
1    GOOG     CHN  1120
2    AAPL     JPN  3340
3    AAPL      UK   657
4    AMZN     GER  7452
5    AMZN     MEX  3500

In [4]:
df.groupby('Company')

In [5]:
# see where memory is stored

You can save this object as a new variable:

In [6]:
by_comp = df.groupby("Company")

And then call aggregate methods off the object:

In [7]:
by_comp.mean() # no numeric value for Company

           Hits
Company
AAPL     1998.5
AMZN     5476.0
GOOG     2560.0

In [8]:
df.groupby('Company').mean()

           Hits
Company
AAPL     1998.5
AMZN     5476.0
GOOG     2560.0

More examples of aggregate methods:

In [9]:
by_comp.std()

                Hits
Company
AAPL     1897.167494
AMZN     2794.485999
GOOG     2036.467530

In [10]:
by_comp.min()

        Country  Hits
Company
AAPL        JPN   657
AMZN        GER  3500
GOOG        CHN  1120

In [11]:
by_comp.max()

        Country  Hits
Company
AAPL         UK  3340
AMZN        MEX  7452
GOOG         US  4000

In [12]:
by_comp.count()

         Country  Hits
Company
AAPL           2     2
AMZN           2     2
GOOG           2     2

In [13]:
by_comp.describe()

         Hits
        count    mean          std     min      25%     50%      75%     max
Company
AAPL      2.0  1998.5  1897.167494   657.0  1327.75  1998.5  2669.25  3340.0
AMZN      2.0  5476.0  2794.485999  3500.0  4488.00  5476.0  6464.00  7452.0
GOOG      2.0  2560.0  2036.467530  1120.0  1840.00  2560.0  3280.00  4000.0

In [14]:
by_comp.describe().transpose()

Company            AAPL         AMZN        GOOG
Hits count     2.000000     2.000000     2.00000
     mean   1998.500000  5476.000000  2560.00000
     std    1897.167494  2794.485999  2036.46753
     min     657.000000  3500.000000  1120.00000
     25%    1327.750000  4488.000000  1840.00000
     50%    1998.500000  5476.000000  2560.00000
     75%    2669.250000  6464.000000  3280.00000
     max    3340.000000  7452.000000  4000.00000

In [15]:
by_comp.describe().transpose()['GOOG']

Hits  count       2.00000
      mean     2560.00000
      std      2036.46753
      min      1120.00000
      25%      1840.00000
      50%      2560.00000
      75%      3280.00000
      max      4000.00000
Name: GOOG, dtype: float64

---

# Exercise
1. Sum of the hits by company
2. Specifically for Google